In [1]:
import sqlite3
import pandas as pd

In [2]:
# Создаем коннектор к файлу нашей базы данных. 
# Само собой, файлик Базы Данных должен лежать рядом с файлом блокнота (который вы сейчас читаете). 
con = sqlite3.connect('EmployeePoints.db')

In [3]:
cur = con.cursor()

In [4]:
cur.execute('SELECT DISTINCT Employee FROM EmployeePoints').fetchall()

[('Маша',), ('Петя',), ('Вася',), ('Саша',), ('Максим',)]

In [7]:
df_2 = pd.read_sql("""
    SELECT DISTINCT Employee FROM EmployeePoints
""",con)

In [8]:
df_2

  Employee
0     Маша
1     Петя
2     Вася
3     Саша
4   Максим

In [6]:
cur.execute("""
    SELECT Employee, COUNT (Point) as NumberOfFive
    from EmployeePoints
    WHERE Point='5'
    GROUP BY Employee
    ORDER BY NumberOfFive DESC
    """).fetchall()

[('Маша', 3), ('Саша', 2)]

In [9]:
df_3 = pd.read_sql("""
    SELECT Employee, COUNT (Point) as NumberOfFive
    from EmployeePoints
    WHERE Point='5'
    GROUP BY Employee
    ORDER BY NumberOfFive DESC
""",con)

In [10]:
df_3

  Employee  NumberOfFive
0     Маша             3
1     Саша             2